{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "67eaf83f",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "from langchain_community.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "09caf837",
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv(\".env\")\n",
    "\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5cc9723f",
   "metadata": {},
   "source": [
    "#### <font color=\"yellow\"> Set up (project the database in a graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ef9d774",
   "metadata": {},
   "source": [
    "\t•\tThe graph projection (gds.graph.project) creates an in-memory graph representation used for fast computation.\n",
    "\t•\tAlgorithms like Leiden run on that in-memory graph."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc77e580",
   "metadata": {},
   "source": [
    "##### Identify there exist a Graph fot the given database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "879f2348",
   "metadata": {},
   "outputs": [],
   "source": [
    "kg_db_name = \"t20\"\n",
    "# kg_db_name = \"t30documentsgraph\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "9f6dd16f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/sq/lqj95by96lnccb74l6fsytf00000gn/T/ipykernel_59432/2508706621.py:1: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-neo4j package and should be used instead. To use it run `pip install -U :class:`~langchain-neo4j` and import as `from :class:`~langchain_neo4j import Neo4jGraph``.\n",
      "  kg = Neo4jGraph(\n"
     ]
    }
   ],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, \n",
    "    username=NEO4J_USERNAME, \n",
    "    password=NEO4J_PASSWORD, \n",
    "    database=kg_db_name\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68fbd14e",
   "metadata": {},
   "source": [
    "#### Detect Hierarchical communities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9f352bae",
   "metadata": {},
   "outputs": [],
   "source": [
    "from src.hierarchical_community_detector import HierarchicalCommunityDetector"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "c9f2730c",
   "metadata": {},
   "outputs": [],
   "source": [
    "hierarchical_community_detector = HierarchicalCommunityDetector(\n",
    "    kg=kg,\n",
    "    kg_db_name=kg_db_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "cc16c574",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "▶ Base graph 't20_projection' already projected.\n",
      "\n",
      "  Skipping Leiden on t20_projection: C3_CommunityId already exists.\n",
      "\n",
      "▶ Graph 'C3_graph' already projected.\n",
      "\n",
      "▶ Running Leiden on C3_graph, writing C2_CommunityId...\n",
      "\n",
      "✅ Full C3 → C0 community hierarchy generated.\n"
     ]
    }
   ],
   "source": [
    "hierarchical_community_detector.detect_hierarchical_communities()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "20c646aa",
   "metadata": {},
   "source": [
    "#### Old code "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "27633a42",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "CALL gds.graph.list()\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "f8ebea51",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "graphs =  kg.query(query=cypher)\n",
    "print(len(graphs))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3257f84e",
   "metadata": {},
   "outputs": [],
   "source": [
    "graphs_db = [graph[\"database\"] for graph in graphs]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "d9e84ad9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There is not a Graph associated to the database\n",
      "Creating Graph in memory\n",
      "Graph created succesfully\n"
     ]
    }
   ],
   "source": [
    "# kg_db_name = \"t30documentsgraph\"\n",
    "if kg_db_name in graphs_db:\n",
    "    print(\"There exist a Graph associated to the database\")\n",
    "    \n",
    "else:\n",
    "    print(\"There is not a Graph associated to the database\")\n",
    "    print(\"Creating Graph in memory\")\n",
    "    labels = kg.query(query=\n",
    "        \"\"\"\n",
    "        CALL db.labels() YIELD label\n",
    "        RETURN collect(label) AS allLabels;\n",
    "        \"\"\"\n",
    "    )[0][\"allLabels\"]\n",
    "    \n",
    "    relationships = kg.query(query=\n",
    "        \"\"\"\n",
    "        CALL db.relationshipTypes() YIELD relationshipType\n",
    "        RETURN collect(relationshipType) AS allTypes;\n",
    "        \"\"\"\n",
    "    )[0][\"allTypes\"]\n",
    "\n",
    "    project_query = f\"\"\"\n",
    "    CALL gds.graph.project(\n",
    "    '{kg_db_name}',\n",
    "    {labels},\n",
    "    {relationships}\n",
    "    )\n",
    "    \"\"\"\n",
    "\n",
    "    # project the database in a graph \n",
    "    kg.query(query=project_query)\n",
    "\n",
    "    print(\"Graph created succesfully\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "eb5c9d44",
   "metadata": {},
   "outputs": [],
   "source": [
    "# we can drop a graph in the following way \n",
    "# CALL gds.graph.drop('myGraphProjection');\n",
    "# it should be executed in the database that contain the graph projected in memory"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "21f23d15",
   "metadata": {},
   "source": [
    "#### <font color=\"yellow\"> Identify communities and write back resutl into the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "89b514f1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'communityCount': 63, 'modularity': 0.6137139162605811}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Run Leiben algorithm to identify communities in the in memory graph, and write \n",
    "# to each node the property community id \n",
    "\n",
    "# kg_db_name = \"t30documentsgraph\"\n",
    "\n",
    "leiben_property_cypher = f\"\"\"\n",
    "    CALL gds.alpha.leiden.write(\n",
    "    '{kg_db_name}',\n",
    "    {{writeProperty: 'communityId' }}\n",
    "    )\n",
    "    YIELD communityCount, modularity;\n",
    "\"\"\"\n",
    "\n",
    "kg.query(query=leiben_property_cypher)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "2e68c1f6",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: The property existence syntax `... exists(variable.property)` is deprecated, please use `variable.property IS NOT NULL` instead} {position: line: 3, column: 7, offset: 17} for query: '\\nMATCH (n)\\nWHERE exists(n.communityId)\\nRETURN n.communityId AS communityId, count(*) AS nodesCount\\nORDER BY communityId\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[0, 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 14, 15, 16, 17, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 32, 33, 34, 35, 36, 38, 39, 40, 41, 42, 44, 45, 48, 49, 50, 51, 52, 53, 54, 55, 56, 58, 60, 62, 63, 64, 65, 66, 67, 68, 69, 72, 73, 74, 76, 79]\n",
      "63\n"
     ]
    }
   ],
   "source": [
    "community_id_cypher = \"\"\"\n",
    "MATCH (n)\n",
    "WHERE exists(n.communityId)\n",
    "RETURN n.communityId AS communityId, count(*) AS nodesCount\n",
    "ORDER BY communityId\n",
    "\"\"\"\n",
    "\n",
    "community_ids = [com['communityId'] for com in kg.query(query=community_id_cypher)]\n",
    "print(community_ids)\n",
    "print(len(community_ids))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db4e6125",
   "metadata": {},
   "source": [
    "#### Get Nodes in Each Community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "bfb476c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: The property existence syntax `... exists(variable.property)` is deprecated, please use `variable.property IS NOT NULL` instead} {position: line: 3, column: 7, offset: 17} for query: '\\nMATCH (n)\\nWHERE exists(n.communityId)\\nRETURN n.communityId AS communityId, collect(id(n)) AS nodeIds\\n'\n"
     ]
    }
   ],
   "source": [
    "community_nodes_cypher = \"\"\"\n",
    "MATCH (n)\n",
    "WHERE exists(n.communityId)\n",
    "RETURN n.communityId AS communityId, collect(id(n)) AS nodeIds\n",
    "\"\"\"\n",
    "community_nodes = {res['communityId']: res['nodeIds'] for res in kg.query(community_nodes_cypher)}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "f0fdc19a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{22: [0, 1, 2, 3, 4, 5, 43, 86, 87, 88, 89, 90, 91, 92, 93, 140, 141, 142, 145], 16: [6, 7, 8, 9, 10, 11, 12], 9: [13, 14, 15, 16, 17, 18, 21, 101, 102, 103, 105, 106, 107, 108], 20: [19], 46: [20], 0: [22, 23, 24, 25, 27], 8: [26], 14: [28, 29, 30, 34, 35, 36, 37, 38, 39, 40, 41, 42, 44, 48], 15: [31, 32, 33, 46, 47, 49, 50, 51, 52, 75, 76, 77, 78, 79, 80, 81, 132, 133, 134, 135, 136, 137, 138, 139], 37: [45], 17: [53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 82, 83, 84], 29: [63, 64, 65, 66, 69, 70], 2: [67], 35: [68], 10: [71, 72, 73, 74], 31: [85], 41: [94, 95, 96, 97, 98, 99, 100], 33: [104], 40: [109, 110, 111, 112, 116, 117, 118], 43: [113, 114, 115], 1: [119, 123, 124, 125, 126, 127, 128, 129, 130, 131], 21: [120, 121, 122], 38: [143], 3: [144], 4: [146, 147, 148, 149, 150, 151, 155, 158, 160, 161, 162, 163, 165], 12: [152], 5: [153], 28: [154], 7: [156], 27: [157], 19: [159], 13: [164], 6: [166]}\n"
     ]
    }
   ],
   "source": [
    "print(community_nodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d2076939",
   "metadata": {},
   "outputs": [],
   "source": [
    "# for each node community get the ranked edge "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "357a7cc4",
   "metadata": {},
   "source": [
    "### Test CommunitySummaries "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c4432d57",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "from langchain_community.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2b5a7cf5",
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv(\".env\")\n",
    "\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "5e96128c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from src.utils.community_summnaries_utils import prioritize_edges, format_kg_output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6bb49ba4",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/sq/lqj95by96lnccb74l6fsytf00000gn/T/ipykernel_27053/788261938.py:2: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-neo4j package and should be used instead. To use it run `pip install -U :class:`~langchain-neo4j` and import as `from :class:`~langchain_neo4j import Neo4jGraph``.\n",
      "  kg = Neo4jGraph(\n"
     ]
    }
   ],
   "source": [
    "kg_db_name = \"t20\"\n",
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, \n",
    "    username=NEO4J_USERNAME, \n",
    "    password=NEO4J_PASSWORD, \n",
    "    database=kg_db_name\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d944e8a1",
   "metadata": {},
   "outputs": [],
   "source": [
    "from src.community_summaries import create_leaf_level_community_summaries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a64b8b82",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "▶ Summarizing C3 Community 6...\n"
     ]
    },
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Unknown function 'degree' (line 5, column 10 (offset: 131))\n\"WITH `r` AS `r`, `source` AS `source`, `target` AS `target`, (`degree`((`source`))) + (`degree`((`target`))) AS `combined_degree`\"\n               ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mCypherSyntaxError\u001b[39m                         Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[6]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m1\u001b[39m \u001b[43mcreate_leaf_level_community_summaries\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m      2\u001b[39m \u001b[43m    \u001b[49m\u001b[43mkg\u001b[49m\u001b[43m=\u001b[49m\u001b[43mkg\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m      3\u001b[39m \u001b[43m    \u001b[49m\u001b[43mkg_db_name\u001b[49m\u001b[43m=\u001b[49m\u001b[43mkg_db_name\u001b[49m\n\u001b[32m      4\u001b[39m \u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/workspace/Master/LLMs/GraphRAG/src/community_summaries.py:307\u001b[39m, in \u001b[36mcreate_leaf_level_community_summaries\u001b[39m\u001b[34m(kg, kg_db_name)\u001b[39m\n\u001b[32m    304\u001b[39m \u001b[38;5;28mprint\u001b[39m(\u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m▶ Summarizing C3 Community \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mcommunity_id\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m...\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    306\u001b[39m \u001b[38;5;66;03m# Extract KG subgraph\u001b[39;00m\n\u001b[32m--> \u001b[39m\u001b[32m307\u001b[39m kg_data = \u001b[43mprioritize_edges\u001b[49m\u001b[43m(\u001b[49m\u001b[43mkg\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcommunity_id\u001b[49m\u001b[43m=\u001b[49m\u001b[43mcommunity_id\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    308\u001b[39m entities_str, relationships_str = format_kg_output(kg_data)\n\u001b[32m    310\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m entities_str \u001b[38;5;129;01mor\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m relationships_str:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/workspace/Master/LLMs/GraphRAG/src/utils/community_summnaries_utils.py:110\u001b[39m, in \u001b[36mprioritize_edges\u001b[39m\u001b[34m(kg, community_id)\u001b[39m\n\u001b[32m     81\u001b[39m \u001b[38;5;250m\u001b[39m\u001b[33;03m\"\"\"\u001b[39;00m\n\u001b[32m     82\u001b[39m \u001b[33;03mReturns a list of prioritized edges in the format:\u001b[39;00m\n\u001b[32m     83\u001b[39m \u001b[33;03m(edge_id, source_id, source_label, source_description, target_id, targer_label, target_description, edge_description)\u001b[39;00m\n\u001b[32m     84\u001b[39m \u001b[33;03msorted by combined degree of source and target nodes (descending).\u001b[39;00m\n\u001b[32m     85\u001b[39m \u001b[33;03m\"\"\"\u001b[39;00m\n\u001b[32m     86\u001b[39m query = \u001b[33mf\u001b[39m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m     87\u001b[39m \u001b[33mMATCH (source)-[r]->(target)\u001b[39m\n\u001b[32m     88\u001b[39m \u001b[33mWHERE source.communityId = \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mcommunity_id\u001b[38;5;132;01m}\u001b[39;00m\u001b[33m AND target.communityId = \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mcommunity_id\u001b[38;5;132;01m}\u001b[39;00m\n\u001b[32m   (...)\u001b[39m\u001b[32m    108\u001b[39m \u001b[33m    CASE WHEN size(edge_props) > 0 THEN apoc.text.join(edge_props, \u001b[39m\u001b[33m\"\u001b[39m\u001b[33m, \u001b[39m\u001b[33m\"\u001b[39m\u001b[33m) ELSE rel_type END AS edge_description\u001b[39m\n\u001b[32m    109\u001b[39m \u001b[33m\u001b[39m\u001b[33m\"\"\"\u001b[39m\n\u001b[32m--> \u001b[39m\u001b[32m110\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mkg\u001b[49m\u001b[43m.\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/langchain_community/graphs/neo4j_graph.py:467\u001b[39m, in \u001b[36mNeo4jGraph.query\u001b[39m\u001b[34m(self, query, params)\u001b[39m\n\u001b[32m    464\u001b[39m \u001b[38;5;28;01mfrom\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34;01mneo4j\u001b[39;00m\u001b[34;01m.\u001b[39;00m\u001b[34;01mexceptions\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[38;5;28;01mimport\u001b[39;00m Neo4jError\n\u001b[32m    466\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m467\u001b[39m     data, _, _ = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_driver\u001b[49m\u001b[43m.\u001b[49m\u001b[43mexecute_query\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    468\u001b[39m \u001b[43m        \u001b[49m\u001b[43mQuery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[43m=\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m=\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43mtimeout\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    469\u001b[39m \u001b[43m        \u001b[49m\u001b[43mdatabase_\u001b[49m\u001b[43m=\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_database\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    470\u001b[39m \u001b[43m        \u001b[49m\u001b[43mparameters_\u001b[49m\u001b[43m=\u001b[49m\u001b[43mparams\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    471\u001b[39m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    472\u001b[39m     json_data = [r.data() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n\u001b[32m    473\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.sanitize:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/driver.py:970\u001b[39m, in \u001b[36mDriver.execute_query\u001b[39m\u001b[34m(self, query_, parameters_, routing_, database_, impersonated_user_, bookmark_manager_, auth_, result_transformer_, **kwargs)\u001b[39m\n\u001b[32m    966\u001b[39m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\n\u001b[32m    967\u001b[39m         \u001b[33mf\u001b[39m\u001b[33m\"\u001b[39m\u001b[33mInvalid routing control value: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mrouting_\u001b[38;5;132;01m!r}\u001b[39;00m\u001b[33m\"\u001b[39m\n\u001b[32m    968\u001b[39m     )\n\u001b[32m    969\u001b[39m \u001b[38;5;28;01mwith\u001b[39;00m session._pipelined_begin:\n\u001b[32m--> \u001b[39m\u001b[32m970\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43msession\u001b[49m\u001b[43m.\u001b[49m\u001b[43m_run_transaction\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    971\u001b[39m \u001b[43m        \u001b[49m\u001b[43maccess_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    972\u001b[39m \u001b[43m        \u001b[49m\u001b[43mTelemetryAPI\u001b[49m\u001b[43m.\u001b[49m\u001b[43mDRIVER\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    973\u001b[39m \u001b[43m        \u001b[49m\u001b[43mwork\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    974\u001b[39m \u001b[43m        \u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery_str\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mresult_transformer_\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    975\u001b[39m \u001b[43m        \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    976\u001b[39m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/work/session.py:583\u001b[39m, in \u001b[36mSession._run_transaction\u001b[39m\u001b[34m(self, access_mode, api, transaction_function, args, kwargs)\u001b[39m\n\u001b[32m    581\u001b[39m tx = \u001b[38;5;28mself\u001b[39m._transaction\n\u001b[32m    582\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m583\u001b[39m     result = \u001b[43mtransaction_function\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtx\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m*\u001b[49m\u001b[43m*\u001b[49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    584\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m asyncio.CancelledError:\n\u001b[32m    585\u001b[39m     \u001b[38;5;66;03m# if cancellation callback has not been called yet:\u001b[39;00m\n\u001b[32m    586\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._transaction \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_work/query.py:144\u001b[39m, in \u001b[36munit_of_work.<locals>.wrapper.<locals>.wrapped\u001b[39m\u001b[34m(*args, **kwargs)\u001b[39m\n\u001b[32m    143\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34mwrapped\u001b[39m(*args, **kwargs):\n\u001b[32m--> \u001b[39m\u001b[32m144\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mf\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m*\u001b[49m\u001b[43m*\u001b[49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/driver.py:1306\u001b[39m, in \u001b[36m_work\u001b[39m\u001b[34m(tx, query, parameters, transformer)\u001b[39m\n\u001b[32m   1300\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34m_work\u001b[39m(\n\u001b[32m   1301\u001b[39m     tx: ManagedTransaction,\n\u001b[32m   1302\u001b[39m     query: te.LiteralString,\n\u001b[32m   1303\u001b[39m     parameters: \u001b[38;5;28mdict\u001b[39m[\u001b[38;5;28mstr\u001b[39m, t.Any],\n\u001b[32m   1304\u001b[39m     transformer: t.Callable[[Result], t.Union[_T]],\n\u001b[32m   1305\u001b[39m ) -> _T:\n\u001b[32m-> \u001b[39m\u001b[32m1306\u001b[39m     res = \u001b[43mtx\u001b[49m\u001b[43m.\u001b[49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m   1307\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m transformer(res)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/work/transaction.py:206\u001b[39m, in \u001b[36mTransactionBase.run\u001b[39m\u001b[34m(self, query, parameters, **kwparameters)\u001b[39m\n\u001b[32m    203\u001b[39m \u001b[38;5;28mself\u001b[39m._results.append(result)\n\u001b[32m    205\u001b[39m parameters = \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, **kwparameters)\n\u001b[32m--> \u001b[39m\u001b[32m206\u001b[39m \u001b[43mresult\u001b[49m\u001b[43m.\u001b[49m\u001b[43m_tx_ready_run\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    208\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m result\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/work/result.py:177\u001b[39m, in \u001b[36mResult._tx_ready_run\u001b[39m\u001b[34m(self, query, parameters)\u001b[39m\n\u001b[32m    173\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34m_tx_ready_run\u001b[39m(\u001b[38;5;28mself\u001b[39m, query, parameters):\n\u001b[32m    174\u001b[39m     \u001b[38;5;66;03m# BEGIN+RUN does not carry any extra on the RUN message.\u001b[39;00m\n\u001b[32m    175\u001b[39m     \u001b[38;5;66;03m# BEGIN {extra}\u001b[39;00m\n\u001b[32m    176\u001b[39m     \u001b[38;5;66;03m# RUN \"query\" {parameters} {extra}\u001b[39;00m\n\u001b[32m--> \u001b[39m\u001b[32m177\u001b[39m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/work/result.py:236\u001b[39m, in \u001b[36mResult._run\u001b[39m\u001b[34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[39m\n\u001b[32m    234\u001b[39m \u001b[38;5;28mself\u001b[39m._pull()\n\u001b[32m    235\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.send_all()\n\u001b[32m--> \u001b[39m\u001b[32m236\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/work/result.py:430\u001b[39m, in \u001b[36mResult._attach\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    428\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m    429\u001b[39m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m._attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m430\u001b[39m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_connection\u001b[49m\u001b[43m.\u001b[49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:184\u001b[39m, in \u001b[36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[39m\u001b[34m(*args, **kwargs)\u001b[39m\n\u001b[32m    182\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34minner\u001b[39m(*args, **kwargs):\n\u001b[32m    183\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m184\u001b[39m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m*\u001b[49m\u001b[43m*\u001b[49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    185\u001b[39m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[32m    186\u001b[39m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio.iscoroutinefunction(\u001b[38;5;28mself\u001b[39m.__on_error)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/io/_bolt.py:864\u001b[39m, in \u001b[36mBolt.fetch_message\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    860\u001b[39m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[32m    861\u001b[39m tag, fields = \u001b[38;5;28mself\u001b[39m.inbox.pop(\n\u001b[32m    862\u001b[39m     hydration_hooks=\u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m].hydration_hooks\n\u001b[32m    863\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m864\u001b[39m res = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    865\u001b[39m \u001b[38;5;28mself\u001b[39m.idle_since = monotonic()\n\u001b[32m    866\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/io/_bolt4.py:498\u001b[39m, in \u001b[36mBolt4x0._process_message\u001b[39m\u001b[34m(self, tag, fields)\u001b[39m\n\u001b[32m    496\u001b[39m \u001b[38;5;28mself\u001b[39m._server_state_manager.state = BoltStates.FAILED\n\u001b[32m    497\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m498\u001b[39m     \u001b[43mresponse\u001b[49m\u001b[43m.\u001b[49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    499\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[32m    500\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.pool:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:254\u001b[39m, in \u001b[36mResponse.on_failure\u001b[39m\u001b[34m(self, metadata)\u001b[39m\n\u001b[32m    252\u001b[39m handler = \u001b[38;5;28mself\u001b[39m.handlers.get(\u001b[33m\"\u001b[39m\u001b[33mon_summary\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    253\u001b[39m Util.callback(handler)\n\u001b[32m--> \u001b[39m\u001b[32m254\u001b[39m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m._hydrate_error(metadata)\n",
      "\u001b[31mCypherSyntaxError\u001b[39m: {code: Neo.ClientError.Statement.SyntaxError} {message: Unknown function 'degree' (line 5, column 10 (offset: 131))\n\"WITH `r` AS `r`, `source` AS `source`, `target` AS `target`, (`degree`((`source`))) + (`degree`((`target`))) AS `combined_degree`\"\n               ^}"
     ]
    }
   ],
   "source": [
    "create_leaf_level_community_summaries(\n",
    "    kg=kg,\n",
    "    kg_db_name=kg_db_name\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0bd1d7d3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "004de909",
   "metadata": {},
   "source": [
    "#### old version of the code "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "1c45f6b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: A pattern expression should only be used in order to test the existence of a pattern. It should therefore only be used in contexts that evaluate to a boolean, e.g. inside the function exists() or in a WHERE-clause. All other uses are deprecated and should be replaced by a pattern comprehension.} {position: line: 5, column: 16, offset: 139} for query: '\\n    MATCH (source)-[r]->(target)\\n    WHERE source.communityId = 12 AND target.communityId = 12\\n    WITH r, source, target,\\n         (size((source)--()) + size((target)--())) AS combined_degree\\n    ORDER BY combined_degree DESC\\n    WITH id(r) AS edge_id,\\n         id(source) AS source_id,\\n         id(target) AS target_id,\\n         labels(source)[0] AS source_label,\\n         labels(target)[0] AS target_label,\\n         [k IN keys(source) WHERE k <> \\'communityId\\' | toString(source[k])] AS source_props,\\n         [k IN keys(target) WHERE k <> \\'communityId\\' | toString(target[k])] AS target_props,\\n         [k IN keys(r) | toString(r[k])] AS edge_props,\\n         type(r) AS rel_type\\n    RETURN edge_id,\\n           source_id,\\n           source_label,\\n           apoc.text.join(source_props, \", \") AS source_description,\\n           target_id,\\n           target_label,\\n           apoc.text.join(target_props, \", \") AS target_description,\\n           CASE WHEN size(edge_props) > 0 THEN apoc.text.join(edge_props, \", \") ELSE rel_type END AS edge_description\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: A pattern expression should only be used in order to test the existence of a pattern. It should therefore only be used in contexts that evaluate to a boolean, e.g. inside the function exists() or in a WHERE-clause. All other uses are deprecated and should be replaced by a pattern comprehension.} {position: line: 5, column: 37, offset: 160} for query: '\\n    MATCH (source)-[r]->(target)\\n    WHERE source.communityId = 12 AND target.communityId = 12\\n    WITH r, source, target,\\n         (size((source)--()) + size((target)--())) AS combined_degree\\n    ORDER BY combined_degree DESC\\n    WITH id(r) AS edge_id,\\n         id(source) AS source_id,\\n         id(target) AS target_id,\\n         labels(source)[0] AS source_label,\\n         labels(target)[0] AS target_label,\\n         [k IN keys(source) WHERE k <> \\'communityId\\' | toString(source[k])] AS source_props,\\n         [k IN keys(target) WHERE k <> \\'communityId\\' | toString(target[k])] AS target_props,\\n         [k IN keys(r) | toString(r[k])] AS edge_props,\\n         type(r) AS rel_type\\n    RETURN edge_id,\\n           source_id,\\n           source_label,\\n           apoc.text.join(source_props, \", \") AS source_description,\\n           target_id,\\n           target_label,\\n           apoc.text.join(target_props, \", \") AS target_description,\\n           CASE WHEN size(edge_props) > 0 THEN apoc.text.join(edge_props, \", \") ELSE rel_type END AS edge_description\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Entities\n",
      "id,entity,description\n",
      "0,Paper,Prompt Design And Engineering\n",
      "2,Method,Chain-Of-Thought\n",
      "5,Topic,Tools For Prompt Engineers\n",
      "4,Topic,Principles Behind Building Llm-Based Agents\n",
      "3,Method,Reflection\n",
      "1,Topic,Core Concepts\n",
      "101,Topic,Complex Reasoning Tasks\n",
      "97,Method,Multi-Agent Systems, Provide more comprehensive solutions by integrating collective intelligence of multiple agents.\n",
      "103,Topic,Multi-Agent Llms\n",
      "\n",
      "Relationships\n",
      "id,source_id,target_id,description\n",
      "1,0,2,USES_METHOD\n",
      "4,0,5,DISCUSSES\n",
      "3,0,4,DISCUSSES\n",
      "2,0,3,USES_METHOD\n",
      "0,0,1,DISCUSSES\n",
      "152,2,101,RELATED_TO\n",
      "157,2,97,RELATED_TO\n",
      "153,97,103,RELATED_TO\n"
     ]
    }
   ],
   "source": [
    "kg_data = prioritize_edges(kg, community_id=12)\n",
    "entities_str, relationships_str = format_kg_output(kg_data)\n",
    "\n",
    "# Print or write to file\n",
    "print(entities_str)\n",
    "print()\n",
    "print(relationships_str)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "b4e91e29",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: The property existence syntax `... exists(variable.property)` is deprecated, please use `variable.property IS NOT NULL` instead} {position: line: 3, column: 23, offset: 33} for query: '\\n        MATCH (n)\\n        WHERE exists(n.communityId)\\n        RETURN count(n) > 0 AS hasCommunityId\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: A pattern expression should only be used in order to test the existence of a pattern. It should therefore only be used in contexts that evaluate to a boolean, e.g. inside the function exists() or in a WHERE-clause. All other uses are deprecated and should be replaced by a pattern comprehension.} {position: line: 5, column: 16, offset: 139} for query: '\\n    MATCH (source)-[r]->(target)\\n    WHERE source.communityId = 12 AND target.communityId = 12\\n    WITH r, source, target,\\n         (size((source)--()) + size((target)--())) AS combined_degree\\n    ORDER BY combined_degree DESC\\n    WITH id(r) AS edge_id,\\n         id(source) AS source_id,\\n         id(target) AS target_id,\\n         labels(source)[0] AS source_label,\\n         labels(target)[0] AS target_label,\\n         [k IN keys(source) WHERE k <> \\'communityId\\' | toString(source[k])] AS source_props,\\n         [k IN keys(target) WHERE k <> \\'communityId\\' | toString(target[k])] AS target_props,\\n         [k IN keys(r) | toString(r[k])] AS edge_props,\\n         type(r) AS rel_type\\n    RETURN edge_id,\\n           source_id,\\n           source_label,\\n           apoc.text.join(source_props, \", \") AS source_description,\\n           target_id,\\n           target_label,\\n           apoc.text.join(target_props, \", \") AS target_description,\\n           CASE WHEN size(edge_props) > 0 THEN apoc.text.join(edge_props, \", \") ELSE rel_type END AS edge_description\\n    '\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: } {title: This feature is deprecated and will be removed in future versions.} {description: A pattern expression should only be used in order to test the existence of a pattern. It should therefore only be used in contexts that evaluate to a boolean, e.g. inside the function exists() or in a WHERE-clause. All other uses are deprecated and should be replaced by a pattern comprehension.} {position: line: 5, column: 37, offset: 160} for query: '\\n    MATCH (source)-[r]->(target)\\n    WHERE source.communityId = 12 AND target.communityId = 12\\n    WITH r, source, target,\\n         (size((source)--()) + size((target)--())) AS combined_degree\\n    ORDER BY combined_degree DESC\\n    WITH id(r) AS edge_id,\\n         id(source) AS source_id,\\n         id(target) AS target_id,\\n         labels(source)[0] AS source_label,\\n         labels(target)[0] AS target_label,\\n         [k IN keys(source) WHERE k <> \\'communityId\\' | toString(source[k])] AS source_props,\\n         [k IN keys(target) WHERE k <> \\'communityId\\' | toString(target[k])] AS target_props,\\n         [k IN keys(r) | toString(r[k])] AS edge_props,\\n         type(r) AS rel_type\\n    RETURN edge_id,\\n           source_id,\\n           source_label,\\n           apoc.text.join(source_props, \", \") AS source_description,\\n           target_id,\\n           target_label,\\n           apoc.text.join(target_props, \", \") AS target_description,\\n           CASE WHEN size(edge_props) > 0 THEN apoc.text.join(edge_props, \", \") ELSE rel_type END AS edge_description\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There exist a Graph associated to the database\n",
      "Entities\n",
      "id,entity,description\n",
      "0,Paper,Prompt Design And Engineering\n",
      "2,Method,Chain-Of-Thought\n",
      "5,Topic,Tools For Prompt Engineers\n",
      "4,Topic,Principles Behind Building Llm-Based Agents\n",
      "3,Method,Reflection\n",
      "1,Topic,Core Concepts\n",
      "101,Topic,Complex Reasoning Tasks\n",
      "97,Method,Multi-Agent Systems, Provide more comprehensive solutions by integrating collective intelligence of multiple agents.\n",
      "103,Topic,Multi-Agent Llms\n",
      "\n",
      "Relationships\n",
      "id,source_id,target_id,description\n",
      "1,0,2,USES_METHOD\n",
      "4,0,5,DISCUSSES\n",
      "3,0,4,DISCUSSES\n",
      "2,0,3,USES_METHOD\n",
      "0,0,1,DISCUSSES\n",
      "152,2,101,RELATED_TO\n",
      "157,2,97,RELATED_TO\n",
      "153,97,103,RELATED_TO\n"
     ]
    }
   ],
   "source": [
    "community_summary = create_communities_to_kg(\n",
    "    kg=kg,\n",
    "    kg_db_name=kg_db_name\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "da0acc11",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Title:\n",
      " Prompt Design And Engineering Paper and Its Methodological & Topical Network \n",
      "\n",
      "\n",
      "Summary:\n",
      "The community is anchored by the paper “Prompt Design And Engineering,” which\n",
      "employs the Chain-Of-Thought and Reflection methods to discuss Core Concepts,\n",
      "Tools For Prompt Engineers, and Principles Behind Building LLM-Based Agents.\n",
      "Chain-Of-Thought further relates to Complex Reasoning Tasks and Multi-Agent\n",
      "Systems, and Multi-Agent Systems in turn connects to Multi-Agent LLMs, forming\n",
      "an integrated network of reasoning techniques and advanced agent architectures\n",
      "[Data: Entities (0); Relationships (1,2,3,4,152,157,153)] \n",
      "\n",
      "\n",
      "Rating:\n",
      "7.5 \n",
      "\n",
      "\n",
      "Rating Explanation:\n",
      "The impact severity rating is high due to the paper’s central role in advancing\n",
      "both fundamental prompt-engineering methods and their extensions into complex\n",
      "reasoning and multi-agent LLM frameworks. \n",
      "\n",
      "\n",
      "Findings:\n",
      "[{'explanation': 'The entity “Prompt Design And Engineering” serves as the hub '\n",
      "                 'of this community, deploying two key reasoning '\n",
      "                 'methods—Chain-Of-Thought and Reflection—and addressing three '\n",
      "                 'primary topics. Its dual use of methods and breadth of '\n",
      "                 'topics indicate a comprehensive treatment of prompt '\n",
      "                 'engineering principles [Data: Entities (0); Relationships '\n",
      "                 '(1,2,3,4,0)]',\n",
      "  'summary': 'Centrality of the paper “Prompt Design And Engineering”'},\n",
      " {'explanation': 'Chain-Of-Thought is one of the principal methods used by the '\n",
      "                 'paper to guide model reasoning, and it is closely linked to '\n",
      "                 'broader research in Complex Reasoning Tasks and Multi-Agent '\n",
      "                 'Systems, underscoring its importance for both individual '\n",
      "                 'thought tracing and collaborative agent frameworks [Data: '\n",
      "                 'Relationships (1,152,157); Entities (2,101,97)]',\n",
      "  'summary': 'Chain-Of-Thought as a core reasoning method'},\n",
      " {'explanation': 'Reflection is employed to enable the model to self-evaluate '\n",
      "                 'and refine its outputs, bolstering robustness in prompt '\n",
      "                 'engineering workflows [Data: Relationships (2); Entities '\n",
      "                 '(3)]',\n",
      "  'summary': 'Reflection method for iterative improvement'},\n",
      " {'explanation': 'The paper discusses three foundational topics—Core Concepts, '\n",
      "                 'Tools For Prompt Engineers, and Principles Behind Building '\n",
      "                 'LLM-Based Agents—providing readers with both theoretical '\n",
      "                 'underpinnings and practical guidance for designing effective '\n",
      "                 'prompts and agent architectures [Data: Relationships '\n",
      "                 '(0,4,3); Entities (1,5,4)]',\n",
      "  'summary': 'Key topics surveyed by the paper'},\n",
      " {'explanation': 'Beyond its application in the paper, Chain-Of-Thought has '\n",
      "                 'direct relevance to Complex Reasoning Tasks and Multi-Agent '\n",
      "                 'Systems, indicating opportunities to leverage reasoning '\n",
      "                 'chains in both deep analytical challenges and collaborative '\n",
      "                 'agent environments [Data: Relationships (152,157); Entities '\n",
      "                 '(101,97)]',\n",
      "  'summary': 'Extension of Chain-Of-Thought to advanced domains'},\n",
      " {'explanation': 'The community reveals a progression whereby the Multi-Agent '\n",
      "                 'Systems method, noted for integrating collective '\n",
      "                 'intelligence, directly relates to emerging Multi-Agent LLMs, '\n",
      "                 'highlighting a research trajectory from classical agent '\n",
      "                 'frameworks to agent-based large language model designs '\n",
      "                 '[Data: Relationships (153); Entities (97,103)]',\n",
      "  'summary': 'Link from Multi-Agent Systems to Multi-Agent LLMs'}]\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "import textwrap\n",
    "from pprint import pprint\n",
    "from IPython.display import Markdown, display\n",
    "community_summary = create_communities_to_kg(\n",
    "    kg=kg,\n",
    "    kg_db_name=kg_db_name\n",
    ")\n",
    "\n",
    "response_text = community_summary.content\n",
    "response_dict = json.loads(response_text)\n",
    "\n",
    "wrapper = textwrap.TextWrapper(width=80)\n",
    "\n",
    "print(\"Title:\\n\", response_dict[\"title\"], \"\\n\\n\")\n",
    "\n",
    "print(\"Summary:\")\n",
    "print(wrapper.fill(response_dict[\"summary\"]), \"\\n\\n\")\n",
    "\n",
    "print(\"Rating:\")\n",
    "print(response_dict[\"rating\"], \"\\n\\n\")\n",
    "\n",
    "print(\"Rating Explanation:\")\n",
    "print(wrapper.fill(response_dict[\"rating explanation\"]), \"\\n\\n\")\n",
    "\n",
    "print(\"Findings:\")\n",
    "pprint(response_dict[\"findings\"], width=80)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "622a7c25",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (venv)",
   "language": "python",
   "name": "venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
